Show / Hide Table of Contents
Class ResultOfInternalForces2
Result of internal forces in the one position
Inheritance
System.Object
ResultOfLoading2
ResultOfInternalForces2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfInternalForces2 : ResultOfLoading2
Constructors
Improve this Doc   View Source
ResultOfInternalForces2()
Constructor
Declaration
public ResultOfInternalForces2()
Properties
Improve this Doc   View Source
Loading
LoadingTypeClass
Declaration
public Loading Loading { get; set; }
Property Value
 Type |  Description
 Loading
Improve this Doc   View Source
Mx
Bending moment around x-axis
Declaration
public double Mx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
My
Bending moment around y-axis
Declaration
public double My { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mz
Bending moment around z-axis
Declaration
public double Mz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
N
Normal force
Declaration
public double N { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Qy
Shear force in y dirrection
Declaration
public double Qy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Qz
Shear force in z dirrection
Declaration
public double Qz { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source